<a href="https://colab.research.google.com/github/Ravneet-kaur1102/MLnow_2.0/blob/main/Assignment1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Our Data
For this lesson, we will be using the Portal Teaching data, a subset of the data from Ernst et al Long-term monitoring and experimental manipulation of a Chihuahuan Desert ecosystem near Portal, Arizona, USA.

We will be using files from the Portal Project Teaching Database. This section will use the surveys.csv file that can be downloaded here: https://ndownloader.figshare.com/files/2292172

We are studying the species and weight of animals caught in sites in our study area. The dataset is stored as a .csv file: each row holds information for a single animal, and the columns represent:

In [103]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [136]:
cd '/content/drive/MyDrive/PYTHON203_DATA_Carpentary'

/content/drive/MyDrive/PYTHON203_DATA_Carpentary

In [134]:
ls

01Python.ipynb  02_Starting_With_Data.ipynb  cleanfile.csv  surveys.csv

In [127]:
import pandas as pd
df= pd.read_csv("surveys.csv")
df.columns
df.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id              int64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
dtype: object

In [128]:
print(f'species_id{df.species_id.unique()}')
print(f'sex{df.sex.unique()}')
print(f'length of sex is {len(df.sex.unique())}')
print(f'length of species_id is {len(df.species_id.unique())}')

species_id['NL' 'DM' 'PF' 'PE' 'DS' 'PP' 'SH' 'OT' 'DO' 'OX' 'SS' 'OL' 'RM' nan 'SA'
 'PM' 'AH' 'DX' 'AB' 'CB' 'CM' 'CQ' 'RF' 'PC' 'PG' 'PH' 'PU' 'CV' 'UR'
 'UP' 'ZL' 'UL' 'CS' 'SC' 'BA' 'SF' 'RO' 'AS' 'SO' 'PI' 'ST' 'CU' 'SU'
 'RX' 'PB' 'PL' 'PX' 'CT' 'US']
sex['M' 'F' nan]
length of sex is 3
length of species_id is 49

# Data Cleaning (Manually/ Automatically)

[Links Followed](https://www.analyticsvidhya.com/blog/2020/03/one-hot-encoding-vs-label-encoding-using-scikit-learn/)

[For Error](https://stackoverflow.com/questions/58868256/scikit-learn-label-encoder-resulting-in-error-argument-must-be-a-string-or-numb)

In [113]:
#assignement1['clean_species_id'] = assignement1['species_id'].apply({'NL':1,'DM':2,'PF':3,'PE':4,'DS':5,'PP':6,'SH':7,
#                                                           'OT':8,'DO':9,'OX':10,'SS':11,'OL':12,'RM':13,'nan':0,
 #                                                            'SA':14,'PM':15,'AH':16,'DX':17,'AB':18,'CB':19,'CM':20,
  #                                                          'CQ':21,'RF':22,'PC':23,'PG':24,'PH':25,'PU':26,'CV':27,
   #                                                            'UR':28,'UP':29,'ZL':30,'UL':31,'CS':32,'SC':33,'BA':34,
    #                                                          'SF':35,'RO':36,'AS':37,'SO':38,'PI':39,'ST':40,'CU':41,
     #                                                         'SU':42,'RX':43,'PB':44,'PL':45,'PX':46,'CT':47,'US':48}.get)
#assignement1['clean_sex']=assignement1['sex'].apply({'M':1,'F':2,'nan':0}.get)
#print(f'length of clean_sex is {len(assignement1.clean_sex.unique())}')
#print(f'length of clean_species_id is {len(assignement1.clean_species_id.unique())}')
#assignement1.head()
print(df.info)
df.head()

<bound method DataFrame.info of        record_id  month  day  year  ...  species_id  sex hindfoot_length  weight
0              1      7   16  1977  ...          NL    M            32.0     NaN
1              2      7   16  1977  ...          NL    M            33.0     NaN
2              3      7   16  1977  ...          DM    F            37.0     NaN
3              4      7   16  1977  ...          DM    M            36.0     NaN
4              5      7   16  1977  ...          DM    M            35.0     NaN
...          ...    ...  ...   ...  ...         ...  ...             ...     ...
35544      35545     12   31  2002  ...          AH  NaN             NaN     NaN
35545      35546     12   31  2002  ...          AH  NaN             NaN     NaN
35546      35547     12   31  2002  ...          RM    F            15.0    14.0
35547      35548     12   31  2002  ...          DO    M            36.0    51.0
35548      35549     12   31  2002  ...         NaN  NaN             NaN     NaN

[35549 rows x 9 columns]>

   record_id  month  day  year  plot_id species_id sex  hindfoot_length  weight
0          1      7   16  1977        2         NL   M             32.0     NaN
1          2      7   16  1977        3         NL   M             33.0     NaN
2          3      7   16  1977        2         DM   F             37.0     NaN
3          4      7   16  1977        7         DM   M             36.0     NaN
4          5      7   16  1977        3         DM   M             35.0     NaN

# Automatic Way

In [129]:
from sklearn.preprocessing import LabelEncoder
clean_species_id = LabelEncoder()
clean_sex = LabelEncoder()
df['clean_sex'] = clean_sex.fit_transform(df['sex'].astype(str)) 
df['clean_species_id'] = clean_species_id.fit_transform(df['species_id'].astype(str))

In [130]:
df.columns

Index(['record_id', 'month', 'day', 'year', 'plot_id', 'species_id', 'sex',
       'hindfoot_length', 'weight', 'clean_sex', 'clean_species_id'],
      dtype='object')

In [131]:
df=df[['record_id','year','plot_id','hindfoot_length', 'weight','clean_species_id','clean_sex']]
df.head()

   record_id  year  plot_id  ...  weight  clean_species_id  clean_sex
0          1  1977        2  ...     NaN                15          1
1          2  1977        3  ...     NaN                15          1
2          3  1977        2  ...     NaN                11          0
3          4  1977        7  ...     NaN                11          1
4          5  1977        3  ...     NaN                11          1

[5 rows x 7 columns]

#Saving the clean file having converted values using `dataframe.to_csv()`

In [137]:
df.to_csv('cleanfile.csv')

In [133]:
df.head()

   record_id  year  plot_id  ...  weight  clean_species_id  clean_sex
0          1  1977        2  ...     NaN                15          1
1          2  1977        3  ...     NaN                15          1
2          3  1977        2  ...     NaN                11          0
3          4  1977        7  ...     NaN                11          1
4          5  1977        3  ...     NaN                11          1

[5 rows x 7 columns]